Mallas/M2.5/constant/polyMesh/boundary
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class polyBoundaryMesh;
 location "constant/polyMesh";
 object boundary;
}

(
  FrontAndBack

  {
    type empty;
    physicalType patch;
    nFaces 85084;
    startFace 70689;

  }
  patch1

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 155773;

  }
  patch2

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 155871;

  }
  patch3

  {
    type wall;
    physicalType patch;
    nFaces 98;
    startFace 155969;

  }
  Shaft

  {
    type wall;
    physicalType patch;
    nFaces 18;
    startFace 156067;

  }
  Inlet

  {
    type patch;
    physicalType patch;
    nFaces 44;
    startFace 156085;

  }
  Lat-Wall

  {
    type wall;
    physicalType patch;
    nFaces 88;
    startFace 156129;

  }
  Outlet

  {
    type patch;
    physicalType patch;
    nFaces 44;
    startFace 156217;

  }
  AMI-St

  {
    type cyclicAMI;
neighbourPatch AMI-Rt;
 matchTolerance 1e-4; 
 transform noOrdering;
    physicalType patch;
    nFaces 164;
    startFace 156261;

  }
  AMI-Rt

  {
    type cyclicAMI;
neighbourPatch AMI-St;
 matchTolerance 1e-4; 
 transform noOrdering;
    physicalType patch;
    nFaces 164;
    startFace 156425;

  }
)


// ************************************************************************* //